app/Modules/Slider/Controllers/Slider.php

SELECT *
FROM `slider`
---
  public function index()
  {
    $data = [
      'title' => 'Slider | Company Profile',
      'slider_list' => $this->slider->findAll()