app/Modules/Product/Controllers/Product.php

  public function index()
  {
    $data = [
      'title' => 'Produk | Daftar Produk',
      'product_list' => $this->product->orderBy('id_product', 'DESC')->findAll()
    ];
---
SELECT *
FROM `product`
ORDER BY `id_product` DESC