app/Modules/Dashboard/Controllers/Dashboard.php

SELECT *
FROM `product`
SELECT COUNT(*) AS `numrows`
FROM `product`
SELECT COUNT(*) AS `numrows`
FROM `category`
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `users`.`deleted_at` IS NULL
---
  public function index()
  {
    $data = [
      'title' => 'Admin Panel',
      'product_list' => $this->product->findAll(),
      'product_count' => $this->product->countAllResults(),
      'category_count' => $this->category->countAllResults(),
      'user_count' => $this->user->countAllResults(),
      'team_count' => $this->team->countAllResults()
    ];