app/Modules/Account/Controllers/Account.php

UPDATE `users` SET `deleted_at` = '2024-02-26 06:14:29', `updated_at` = '2024-02-26 06:14:29'
WHERE `id` = '5'
AND `deleted_at` IS NULL
---
  public function deleteAccount()
  {
    if ($this->request->isAJAX()) {
      $id = $this->request->getVar('id');
      $this->userModel->where('id', $id)->delete();