app/Modules/Beranda/Controllers/Beranda.php

SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
SELECT *
FROM `slider`
---
  public function index()
  {
    $data = [
      'title' => 'Beranda | Company Profile',
      'user_list' => $this->userModel->findAll(),
      'slider_list' => $this->sliderModel->findAll(),